posts/linux-process-and-subprocess/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns#" lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta http-equiv="x-ua-compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Tips on Linux Process and Subprocess | Hack Note</title>
<meta name="theme-color" content="#04519b">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="/rss.xml">
<link href="https://cdn.jsdelivr.net/gh/samsonwang/blog@master/assets/css/minima.min.css" rel="stylesheet" type="text/css">
<link rel="canonical" href="https://blog.wangzhl.com/posts/linux-process-and-subprocess/">
<link rel="icon" href="/favicon.ico" sizes="64x64">
<link rel="prev" href="/posts/linux-errno-cheatsheet/" title="Linux系统errno速查表" type="text/html">
<link rel="next" href="/posts/cpp-python-hybird-programming/" title="C++(Qt)和Python混合编程的一些经验之谈" type="text/html">
<meta name="author" content="Samson Wang">
<meta property="og:site_name" content="Hack Note">
<meta property="og:title" content="Tips on Linux Process and Subprocess">
<meta property="og:url" content="https://blog.wangzhl.com/posts/linux-process-and-subprocess/">
<meta property="og:description" content="Here are some tips on Linux process and subprocess, such as orphan process, zombie process, process exit and close on exec flag.





1 Orphan process


1.1 What is orphan process?


In Linux system, ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2019-01-25T16:50:23+08:00">
<meta property="article:tag" content="close on exec">
<meta property="article:tag" content="exit">
<meta property="article:tag" content="linux">
<meta property="article:tag" content="orphan process">
<meta property="article:tag" content="process">
<meta property="article:tag" content="zombie process">
</head>
<body>
  <header class="site-header nav-custom"><div class="wrapper">
      <a class="site-title" rel="author" href="/">Hack Note</a>
      <nav class="site-nav"><input type="checkbox" id="nav-trigger" class="nav-trigger"><label for="nav-trigger">
          <span class="menu-icon">
            <svg viewbox="0 0 18 15" width="18px" height="15px"><use href="/assets/svg/theme.svg#menu-icon"></use></svg></span>
        </label>
        <div class="trigger">
          
            <a class="page-link" href="/">Home</a>
            <a class="page-link" href="/archive/">Archive</a>
            <a class="page-link" href="/tag/">Tag</a>
            <a class="page-link" href="/about/">About</a>

        </div>
      </nav>
</div>
  </header><main class="page-content" aria-label="Content"><div class="wrapper">

    

    
<article class="post h-entry" itemscope="" itemtype="http://schema.org/BlogPosting"><header class="post-header"><h1 class="post-title p-name" itemprop="name headline">Tips on Linux Process and Subprocess</h1>

    <p class="post-meta">
      
    <time class="dt-published" datetime="2019-01-25T16:50:23+08:00" itemprop="datePublished">Jan 25, 2019</time></p>
  </header><div class="post-content e-content" itemprop="articleBody text">
    <p>
Here are some tips on Linux process and subprocess, such as orphan process, zombie process, process exit and close on exec flag.<br></p>

<!-- TEASER_END -->

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">
<span class="section-number-2">1</span> Orphan process</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">
<span class="section-number-3">1.1</span> What is orphan process?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In Linux system, when parent process exits and child process is still running, the child process becomes an orphan process. Any orphaned process will be immediately adopted by the special init system process.<br></p>

<p>
Here is a demo code to make a orphan process.<br></p>
<div class="highlight"><pre><span></span><span class="cp">#include</span> <span class="cpf">&lt;stdlib.h&gt;</span><span class="cp"></span>
<span class="cp">#include</span> <span class="cpf">&lt;unistd.h&gt;</span><span class="cp"></span>
<span class="cp">#include</span> <span class="cpf">&lt;stdio.h&gt;</span><span class="cp"></span>

<span class="kt">int</span> <span class="nf">main</span><span class="p">()</span> <span class="p">{</span>
    <span class="k">switch</span><span class="p">(</span><span class="n">fork</span><span class="p">())</span> <span class="p">{</span>
    <span class="k">case</span> <span class="o">-</span><span class="mi">1</span><span class="o">:</span>
	<span class="n">printf</span><span class="p">(</span><span class="s">"fail to create subprocess</span><span class="se">\n</span><span class="s">"</span><span class="p">);</span>
	<span class="k">break</span><span class="p">;</span>
    <span class="k">case</span> <span class="mi">0</span><span class="o">:</span>
	<span class="n">printf</span><span class="p">(</span><span class="s">"child process, pid = %d</span><span class="se">\n</span><span class="s">"</span><span class="p">,</span> <span class="n">getpid</span><span class="p">());</span>
	<span class="n">sleep</span><span class="p">(</span><span class="mi">30</span><span class="p">);</span>
	<span class="k">break</span><span class="p">;</span>
    <span class="k">default</span><span class="o">:</span>
	<span class="n">printf</span><span class="p">(</span><span class="s">"parent process, pid = %d</span><span class="se">\n</span><span class="s">"</span><span class="p">,</span> <span class="n">getpid</span><span class="p">());</span>
	<span class="n">sleep</span><span class="p">(</span><span class="mi">10</span><span class="p">);</span>
	<span class="k">break</span><span class="p">;</span>
    <span class="p">}</span>
    <span class="k">return</span> <span class="mi">0</span><span class="p">;</span>
<span class="p">}</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">
<span class="section-number-3">1.2</span> How to make child process exit after parent process exits?</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Child process can ask kernel to send a signal when its parent dies by <code>prctl()</code> system call. This works in Linux only.<br>
</li>
</ol>
<p>
Here is the demo code:<br></p>
<div class="highlight"><pre><span></span><span class="n">prctl</span><span class="p">(</span><span class="n">PR_SET_PDEATHSIG</span><span class="p">,</span> <span class="n">SIGHUP</span><span class="p">);</span>
</pre></div>

<ol class="org-ol">
<li>As child process id is changed to 1 (the init pid) after parent process exits, the child process could poll its parent process id by <code>getppid()</code> . When its parent process id becomes 1, the child process is an orphan process.<br>
</li>
</ol>
<p>
Function to get process identification.<br></p>
<div class="highlight"><pre><span></span><span class="c1">// get process id</span>
<span class="kt">pid_t</span> <span class="nf">getpid</span><span class="p">();</span>
<span class="c1">// get parent process id</span>
<span class="kt">pid_t</span> <span class="nf">getppid</span><span class="p">();</span>
</pre></div>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">
<span class="section-number-2">2</span> Zombie process</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">
<span class="section-number-3">2.1</span> What is a zombie process?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Zombie process is also called defunct process. When child process has finished the execution (via the <code>exit</code> system call) but still has entry in the process table: It is a process in the "Terminated state". The parent process should read (via the <code>wait</code> system call) its child's exit staus from process table, then the child process entry is removed from the process table and is said to be "reaped".<br></p>

<p>
A child process always first becomes a zombie before being removed from the resource table. In most cases, under normal system operation zombies are immediately waited on by their parent and then reaped by the system – processes that stay zombies for a long time are generally an error and cause a resource leak.<br></p>

<p>
Here is a demo code to make a zombie process.<br></p>
<div class="highlight"><pre><span></span><span class="cp">#include</span> <span class="cpf">&lt;stdlib.h&gt;</span><span class="cp"></span>
<span class="cp">#include</span> <span class="cpf">&lt;unistd.h&gt;</span><span class="cp"></span>
<span class="cp">#include</span> <span class="cpf">&lt;stdio.h&gt;</span><span class="cp"></span>

<span class="kt">int</span> <span class="nf">main</span><span class="p">()</span> <span class="p">{</span>
    <span class="k">switch</span><span class="p">(</span><span class="n">fork</span><span class="p">())</span> <span class="p">{</span>
    <span class="k">case</span> <span class="o">-</span><span class="mi">1</span><span class="o">:</span>
	<span class="n">printf</span><span class="p">(</span><span class="s">"fail to create subprocess</span><span class="se">\n</span><span class="s">"</span><span class="p">);</span>
	<span class="k">break</span><span class="p">;</span>
    <span class="k">case</span> <span class="mi">0</span><span class="o">:</span>
	<span class="n">printf</span><span class="p">(</span><span class="s">"child process, pid = %d</span><span class="se">\n</span><span class="s">"</span><span class="p">,</span> <span class="n">getpid</span><span class="p">());</span>
	<span class="n">sleep</span><span class="p">(</span><span class="mi">10</span><span class="p">);</span>
	<span class="k">break</span><span class="p">;</span>
    <span class="k">default</span><span class="o">:</span>
	<span class="n">printf</span><span class="p">(</span><span class="s">"parent process, pid = %d</span><span class="se">\n</span><span class="s">"</span><span class="p">,</span> <span class="n">getpid</span><span class="p">());</span>
	<span class="n">sleep</span><span class="p">(</span><span class="mi">30</span><span class="p">);</span>
	<span class="k">break</span><span class="p">;</span>
    <span class="p">}</span>
    <span class="k">return</span> <span class="mi">0</span><span class="p">;</span>
<span class="p">}</span>
</pre></div>

<p>
Check out process tree using the following command.<br></p>
<div class="highlight"><pre><span></span>ps -efx
</pre></div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">
<span class="section-number-3">2.2</span> How to kill a zombie process?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
As a zombie process is already dead, so you can not <code>kill</code> it. The <code>kill</code> command has no effect on a zombie process.<br></p>

<p>
To clean up a zombie, it must be waited on by its parent, so killing the parent should work to eliminate the zombie. (After the parent dies, the zombie will be inherited by init process (pid 1), which will wait on it and clear its entry in the process table).<br></p>

<p>
The following command will kill all the parent processes that has a zombie child process. As this might kill processes that is running normally, it is not recommended. The better solution is to find out the very zombie process and stop its parent.<br></p>
<div class="highlight"><pre><span></span><span class="nb">kill</span> <span class="k">$(</span>ps -A -ostat,ppid <span class="p">|</span> awk <span class="s1">'/[zZ]/ &amp;&amp; !a[$2]++ {print $2}'</span><span class="k">)</span>
</pre></div>
</div>
</div>
</div>
