posts/linux-process-and-subprocess.org
*** ~exit~ function
~exit()~ function performs some cleaning before termination of the program, such as the ~atexit()~ registered method and buffer flushing.

Here is the demo code:
#+BEGIN_SRC c
#include <stdio.h>
#include <stdlib.h>

void cleanup() {
    printf("cleanup ...\n"); // this will be printed
}

int main(int argc, char* argv[]) {
    printf("process running ...\n");
    atexit(cleanup);
    printf("buffer information ..."); // this will be fulshed
    exit(0);
    return 0;
}
#+END_SRC

*** ~_exit~ or ~_Exit~ function
~_exit()~ is equivalent to ~_Exit()~ . They all cause normal program termination to occur without completely cleaning the resources. The minor difference is ~_Exit~ is from C99 and ~_exit~ is from POSIX.

Use ~_exit~ (or ~_Exit~ ) in child process to avoid unintended calling ~atexit()~ handlers and flushing buffers from parent process.

Here is the demo code:
#+BEGIN_SRC c
#include <stdio.h>
#include <stdlib.h>

void cleanup() {
    printf("cleanup ...\n"); // this will not be printed
}

int main(int argc, char* argv[]) {
    printf("process running ...\n");
    atexit(cleanup);
    printf("buffer information ...");  // this will not be fulshed
    _Exit(0);
    return 0;
}
#+END_SRC


** Close on exec flag
The =close-on-exec= flag is set on file descriptor to indicate that the descriptor should be closed when an ~exec~ function is invoked. The flag is initially disabled on new descriptors, the descriptor will survive into the new program after ~exec~ , and resource is leaked. This would happen unintentionally when parent process forks a child and the child calls ~exec~ .

It is a good programming practice to use this flag in order to close the descriptor by default.
#+BEGIN_SRC c
int fd1 = open(path, O_CLOEXEC | flags);
int fd2 = socket(DOMAIN, SOCK_CLOEXEC | type, PROTOCOL);
int fd3 = accept4(int sockfd, struct sockaddr *addr,
                  socklen_t *addrlen, SOCK_CLOEXEC | flags);
int fd4 = fopen(path, "re");
#+END_SRC

If you want to modify flags on an existing file descriptor, you should get the current flags with =F_GETFD= and modify the value. Don’t assume that the flags listed here are the only ones that are implemented; your program may be run years from now and more flags may exist then. For example, here is a function to set or clear the flag =FD_CLOEXEC= without altering any other flags:

#+BEGIN_SRC c
/* Set the FD_CLOEXEC flag of desc if value is nonzero,
   or clear the flag if value is 0.
   Return 0 on success, or -1 on error with errno set. */
int set_cloexec_flag (int desc, int value) {
    int oldflags = fcntl (desc, F_GETFD, 0);
    /* If reading the flags failed, return error indication now. */
    if (oldflags < 0)
        return oldflags;
    /* Set just the flag we want to set. */
    if (value != 0)
        oldflags |= FD_CLOEXEC;
    else
        oldflags &= ~FD_CLOEXEC;
    /* Store modified flag word in the descriptor. */
    return fcntl (desc, F_SETFD, oldflags);
}
#+END_SRC


