posts/linux-process-and-subprocess/index.html


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">
<span class="section-number-2">3</span> Process exit</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">
<span class="section-number-3">3.1</span> <code>exit</code> function</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>exit()</code> function performs some cleaning before termination of the program, such as the <code>atexit()</code> registered method and buffer flushing.<br></p>

<p>
Here is the demo code:<br></p>
<div class="highlight"><pre><span></span><span class="cp">#include</span> <span class="cpf">&lt;stdio.h&gt;</span><span class="cp"></span>
<span class="cp">#include</span> <span class="cpf">&lt;stdlib.h&gt;</span><span class="cp"></span>

<span class="kt">void</span> <span class="nf">cleanup</span><span class="p">()</span> <span class="p">{</span>
    <span class="n">printf</span><span class="p">(</span><span class="s">"cleanup ...</span><span class="se">\n</span><span class="s">"</span><span class="p">);</span> <span class="c1">// this will be printed</span>
<span class="p">}</span>

<span class="kt">int</span> <span class="nf">main</span><span class="p">(</span><span class="kt">int</span> <span class="n">argc</span><span class="p">,</span> <span class="kt">char</span><span class="o">*</span> <span class="n">argv</span><span class="p">[])</span> <span class="p">{</span>
    <span class="n">printf</span><span class="p">(</span><span class="s">"process running ...</span><span class="se">\n</span><span class="s">"</span><span class="p">);</span>
    <span class="n">atexit</span><span class="p">(</span><span class="n">cleanup</span><span class="p">);</span>
    <span class="n">printf</span><span class="p">(</span><span class="s">"buffer information ..."</span><span class="p">);</span> <span class="c1">// this will be fulshed</span>
    <span class="n">exit</span><span class="p">(</span><span class="mi">0</span><span class="p">);</span>
    <span class="k">return</span> <span class="mi">0</span><span class="p">;</span>
<span class="p">}</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">
<span class="section-number-3">3.2</span> <code>_exit</code> or <code>_Exit</code> function</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>_exit()</code> is equivalent to <code>_Exit()</code> . They all cause normal program termination to occur without completely cleaning the resources. The minor difference is <code>_Exit</code> is from C99 and <code>_exit</code> is from POSIX.<br></p>

<p>
Use <code>_exit</code> (or <code>_Exit</code> ) in child process to avoid unintended calling <code>atexit()</code> handlers and flushing buffers from parent process.<br></p>

<p>
Here is the demo code:<br></p>
<div class="highlight"><pre><span></span><span class="cp">#include</span> <span class="cpf">&lt;stdio.h&gt;</span><span class="cp"></span>
<span class="cp">#include</span> <span class="cpf">&lt;stdlib.h&gt;</span><span class="cp"></span>

<span class="kt">void</span> <span class="nf">cleanup</span><span class="p">()</span> <span class="p">{</span>
    <span class="n">printf</span><span class="p">(</span><span class="s">"cleanup ...</span><span class="se">\n</span><span class="s">"</span><span class="p">);</span> <span class="c1">// this will not be printed</span>
<span class="p">}</span>

<span class="kt">int</span> <span class="nf">main</span><span class="p">(</span><span class="kt">int</span> <span class="n">argc</span><span class="p">,</span> <span class="kt">char</span><span class="o">*</span> <span class="n">argv</span><span class="p">[])</span> <span class="p">{</span>
    <span class="n">printf</span><span class="p">(</span><span class="s">"process running ...</span><span class="se">\n</span><span class="s">"</span><span class="p">);</span>
    <span class="n">atexit</span><span class="p">(</span><span class="n">cleanup</span><span class="p">);</span>
    <span class="n">printf</span><span class="p">(</span><span class="s">"buffer information ..."</span><span class="p">);</span>  <span class="c1">// this will not be fulshed</span>
    <span class="n">_Exit</span><span class="p">(</span><span class="mi">0</span><span class="p">);</span>
    <span class="k">return</span> <span class="mi">0</span><span class="p">;</span>
<span class="p">}</span>
</pre></div>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">
<span class="section-number-2">4</span> <code>close-on-exec</code> flag</h2>
<div class="outline-text-2" id="text-4">
<p>
The <code>close-on-exec</code> flag is set on file descriptor to indicate that the descriptor should be closed when an <code>exec</code> function is invoked. The flag is initially disabled on new descriptors, the descriptor will survive into the new program after <code>exec</code> , and resource is leaked. This would happen unintentionally when parent process forks a child and the child calls <code>exec</code> .<br></p>

<p>
It is a good programming practice to use this flag in order to close the descriptor automaticly by default.<br></p>
<div class="highlight"><pre><span></span><span class="kt">int</span> <span class="n">fd1</span> <span class="o">=</span> <span class="n">open</span><span class="p">(</span><span class="n">path</span><span class="p">,</span> <span class="n">O_CLOEXEC</span> <span class="o">|</span> <span class="n">flags</span><span class="p">);</span>
<span class="kt">int</span> <span class="n">fd2</span> <span class="o">=</span> <span class="n">socket</span><span class="p">(</span><span class="n">DOMAIN</span><span class="p">,</span> <span class="n">SOCK_CLOEXEC</span> <span class="o">|</span> <span class="n">type</span><span class="p">,</span> <span class="n">PROTOCOL</span><span class="p">);</span>
<span class="kt">int</span> <span class="n">fd3</span> <span class="o">=</span> <span class="n">accept4</span><span class="p">(</span><span class="kt">int</span> <span class="n">sockfd</span><span class="p">,</span> <span class="k">struct</span> <span class="n">sockaddr</span> <span class="o">*</span><span class="n">addr</span><span class="p">,</span>
		  <span class="kt">socklen_t</span> <span class="o">*</span><span class="n">addrlen</span><span class="p">,</span> <span class="n">SOCK_CLOEXEC</span> <span class="o">|</span> <span class="n">flags</span><span class="p">);</span>
<span class="kt">int</span> <span class="n">fd4</span> <span class="o">=</span> <span class="n">fopen</span><span class="p">(</span><span class="n">path</span><span class="p">,</span> <span class="s">"re"</span><span class="p">);</span>
</pre></div>

<p>
If you want to modify flags on an existing file descriptor, you should get the current flags with <code>F_GETFD</code> and modify the value. Don’t assume that the flags listed here are the only ones that are implemented; your program may be run years from now and more flags may exist then. For example, here is a function to set or clear the flag <code>FD_CLOEXEC</code> without altering any other flags:<br></p>

<div class="highlight"><pre><span></span><span class="cm">/* Set the FD_CLOEXEC flag of desc if value is nonzero,</span>
<span class="cm">   or clear the flag if value is 0.</span>
<span class="cm">   Return 0 on success, or -1 on error with errno set. */</span>
<span class="kt">int</span> <span class="nf">set_cloexec_flag</span> <span class="p">(</span><span class="kt">int</span> <span class="n">desc</span><span class="p">,</span> <span class="kt">int</span> <span class="n">value</span><span class="p">)</span> <span class="p">{</span>
    <span class="kt">int</span> <span class="n">oldflags</span> <span class="o">=</span> <span class="n">fcntl</span> <span class="p">(</span><span class="n">desc</span><span class="p">,</span> <span class="n">F_GETFD</span><span class="p">,</span> <span class="mi">0</span><span class="p">);</span>
    <span class="cm">/* If reading the flags failed, return error indication now. */</span>
    <span class="k">if</span> <span class="p">(</span><span class="n">oldflags</span> <span class="o">&lt;</span> <span class="mi">0</span><span class="p">)</span>
	<span class="k">return</span> <span class="n">oldflags</span><span class="p">;</span>
    <span class="cm">/* Set just the flag we want to set. */</span>
    <span class="k">if</span> <span class="p">(</span><span class="n">value</span> <span class="o">!=</span> <span class="mi">0</span><span class="p">)</span>
	<span class="n">oldflags</span> <span class="o">|=</span> <span class="n">FD_CLOEXEC</span><span class="p">;</span>
    <span class="k">else</span>
	<span class="n">oldflags</span> <span class="o">&amp;=</span> <span class="o">~</span><span class="n">FD_CLOEXEC</span><span class="p">;</span>
    <span class="cm">/* Store modified flag word in the descriptor. */</span>
    <span class="k">return</span> <span class="n">fcntl</span> <span class="p">(</span><span class="n">desc</span><span class="p">,</span> <span class="n">F_SETFD</span><span class="p">,</span> <span class="n">oldflags</span><span class="p">);</span>
<span class="p">}</span>
</pre></div>
</div>
</div>
